DataProcessors/омг_АРМОператора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_АРМОператора</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/омг_ПлановыеПоказателиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ПлановыеПоказателиСотрудников</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиKPI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧекиПробиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЧастичноПробиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиНеПробиты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛистОжидания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЛистОжидания</Name>
			<BasedOn>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.Прием</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВыполнения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЛистаОжидания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеСодержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗаписиНаПрием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoogleIDСобытия</Name>
					<Comment>Используется 33 символа, непонятно, как будет потом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoogleКалендарьИмпорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРекламы</Name>
					<Comment>UTM_MEDIUM</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРекламы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Comment>UTM_SOURCE</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКомпания</Name>
					<Comment>UTM_CAMPAIGN</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеСловоРекламнойКомпании</Name>
					<Comment>UTM_TERM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеОбъявления</Name>
					<Comment>UTM_CONTENT</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЖелаемоеВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененияПериода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/омг_АРМОператора/Forms/Форма_85/Ext/Form/Module.bsl
&НаСервере
Процедура ОткрытьКалендарьНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКалендарь(Команда) 
	
	ДанныеАРМ = Новый Структура;
	ДанныеАРМ.Вставить("ФормаВызова", "Обработка.омг_АРМРегистратора.Форма.Форма_85");
	
	ПараметрыФормы = Новый Структура("Данные");
	ПараметрыФормы.Данные = ДанныеАРМ;
	
	ОткрытьФорму("Отчет.КалендарьПланирования.Форма.ФормаОтчетаУпр_85", ПараметрыФормы);
	//ОткрытьКалендарьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКлиентов(Команда)
	ОткрытьФорму("Справочник.Клиенты.Форма.ФормаСписка_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗаявок(Команда)
	ОткрытьФорму("Документ.Заявка.Форма.ФормаСписка_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетКонверсия(Команда)
	//ОткрытьФорму("Отчет.омг_КонверсияСобытий.Форма",);
	КлючНужногоВарианта = ПолучитьКлючВариантаНаСервере("Конверсия событий (для операторов)");
	Если КлючНужногоВарианта = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Система не нашла вариант отчета с таким именем!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", КлючНужногоВарианта);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ответственный", ПолучитьТекущегоПользователяНаСервере()); 
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ТекПериод = Новый СтандартныйПериод;
	ТекПериод.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Период", ТекПериод); 
	ПараметрыФормы.Вставить("ПараметрыДанных", ПараметрыДанных);
	
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина); 
	
	ОткрытьФорму("Отчет.омг_КонверсияСобытий.Форма", ПараметрыФормы);
КонецПроцедуры 
&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователяНаСервере()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКлючВариантаНаСервере(НаименованиеВарианта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВариантыОтчетов.КлючВарианта КАК Ключ
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Наименование = &Наименование
	|	И ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеВарианта);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ключ; 
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСписокПриходныхОрдеров(Команда)
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокРасходныхОрдеров(Команда)
	ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОплатПлатежнойКартой(Команда)
	ОткрытьФорму("Документ.ОплатаПлатежнойКартой.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВозвратовНаПлатежнуюКарту(Команда)
	ОткрытьФорму("Документ.ВозвратПоПлатежнойКарте.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЛистоОжиданий(Команда)
	ОткрытьФорму("Документ.ЛистОжидания.Форма.ФормаСписка85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОплаты(Команда)
	ОткрытьФорму("Отчет.Оплаты.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьПоДенежнымСредствам(Команда)
	ОткрытьФорму("Отчет.ДвижениеДенежныхСредствВКассах.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДвижениеДенежныхСредств(Команда)
	ОткрытьФорму("Отчет.ДвиженияДенежныхСредств.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУправлениеФискальнымУстройством(Команда)
	ОткрытьФорму("ОбщаяФорма.УправлениеФискальнымУстройством");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбучение(Команда)
	ОткрытьФорму("Обработка.омг_Обучение.Форма.Форма_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАРМПостовойМедсестры(Команда)
	ОткрытьФорму("ОбщаяФорма.АРМПостовойМедсестры85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАРМПалатнойМедсестры(Команда)
	ОткрытьФорму("ОбщаяФорма.АРМПалатнойМедсестры");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСофтФон(Команда)
	//СтрокаКлюч = "OMG_Телефония";
	//ОткрытьФорму("Обработка.доп_Битфон.Форма.ОсновнаяФорма85",,,СтрокаКлюч);
			ФормаСофтФон = ПолучитьФорму("Обработка.доп_Битфон.Форма.ОсновнаяФорма85");
		Если ФормаСофтФон.Открыта() Тогда
			ФормаСофтФон.Активизировать();		
		Иначе
			ФормаСофтФон.Открыть();
			ФормаСофтФон.Активизировать();
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьWhatsApp(Команда)
	ОткрытьФорму("Обработка.iga_ChatBot.Форма.АРМОператора");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрайсЛист(Команда)
	ОткрытьФорму("Отчет.ПрайсЛистПоНоменклатуре.Форма");
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьТестовыйПериод(Команда)
	Если Не ЗначениеЗаполнено(ПериодОтчета.ДатаНачала) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пожалуйста, выберите период для расчета!");
		Возврат;
	КонецЕсли;
	
	РассчитатьПоказателиНаСервере();
КонецПроцедуры 

&НаСервере
Функция ПолучитьФилиалПользователя()
	
	ОсновнаяОрганизация = Справочники.Организации.ПустаяСсылка(); 
	
	НастройкаОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.омг_ОсновнаяОрганизация;
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПользователей.Значение КАК Организация
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка = &НастройкаОрганизация";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкаОрганизация", НастройкаОрганизация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОсновнаяОрганизация = Выборка.Организация;
	КонецЕсли;
	
	Возврат ОсновнаяОрганизация;
	
КонецФункции

&НаСервере
Процедура РассчитатьПоказателиНаСервере()
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТекФилиал = ПолучитьФилиалПользователя();
	
	// ==========================================
	// 1. РАСЧЕТ ЗВОНКОВ
	// ==========================================
	ЗапросЗвонки = Новый Запрос;
	ЗапросЗвонки.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА Событие.ФактическийИсполнитель = &Пользователь
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МоиЗвонки,
	|	КОЛИЧЕСТВО(Событие.Ссылка) КАК ЗвонкиФилиала
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ВходящийЗвонок)
	|	И Событие.ДатаФакт МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Событие.УспешностьЗвонка = ИСТИНА
	|	И Событие.омг_Организация = &ТекФилиал"; 
	
	ЗапросЗвонки.УстановитьПараметр("Пользователь", ТекПользователь);
	ЗапросЗвонки.УстановитьПараметр("ТекФилиал", ТекФилиал);
	ЗапросЗвонки.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
	ЗапросЗвонки.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодОтчета.ДатаОкончания));
	
	РезЗвонки = ЗапросЗвонки.Выполнить();
	
	Если Не РезЗвонки.Пустой() Тогда
		ВыбЗвонки = РезЗвонки.Выбрать();
		ВыбЗвонки.Следующий();
		
		КоличествоВходящихЗвонков = ?(ВыбЗвонки.МоиЗвонки = NULL, 0, ВыбЗвонки.МоиЗвонки);
		ВсегоЗвонковПоФилиалу     = ?(ВыбЗвонки.ЗвонкиФилиала = NULL, 0, ВыбЗвонки.ЗвонкиФилиала);
	Иначе
		КоличествоВходящихЗвонков = 0;
		ВсегоЗвонковПоФилиалу = 0;
	КонецЕсли;
	// ==========================================
	// ОТРИСОВКА ДИАГРАММЫ ЗВОНКОВ
	// ==========================================
	ЗвонкиКоллег = ВсегоЗвонковПоФилиалу - КоличествоВходящихЗвонков;
	Если ЗвонкиКоллег < 0 Тогда 
		ЗвонкиКоллег = 0; 
	КонецЕсли;
	
	ДиаграммаЗвонков.Обновление = Ложь;
	ДиаграммаЗвонков.Очистить();
	ДиаграммаЗвонков.АвтоТранспонирование = Ложь;
	Точка = ДиаграммаЗвонков.УстановитьТочку(ВсегоЗвонковПоФилиалу);
	СерияМои = ДиаграммаЗвонков.УстановитьСерию("Принятые мной");
	СерияМои.Цвет = WebЦвета.Бирюзовый;
	ДиаграммаЗвонков.УстановитьЗначение(Точка , СерияМои, КоличествоВходящихЗвонков);
	СерияКоллеги = ДиаграммаЗвонков.УстановитьСерию("Принятые другими операторами");
	СерияКоллеги.Цвет = WebЦвета.Киноварь;
	ДиаграммаЗвонков.УстановитьЗначение(Точка , СерияКоллеги, ЗвонкиКоллег);
	ДиаграммаЗвонков.Обновление = Истина;
	
	// ==========================================
	// 2. РАСЧЕТ ВЫРУЧКИ ПО ОКАЗАНИЮ УСЛУГ
	// ==========================================
	ЗапросВыручка = Новый Запрос;
	
	ЗапросВыручка.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ПродажиОбороты.СуммаОборот), 0) КАК СуммаВыручки
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ОказаниеУслуг
	|	И ПродажиОбороты.Регистратор.ДокументОснование.Ответственный = &Пользователь
	|	И ПродажиОбороты.Регистратор.ДокументОснование.Состояние = &СостояниеВыполнена
	|	И (ПродажиОбороты.Регистратор.СостояниеЧековККМ = ЗНАЧЕНИЕ(Перечисление.СостоянияЧековККМ.ЧекиПробиты)
	|		ИЛИ ПродажиОбороты.Регистратор.омг_СтраховаяПрограмма <> ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка))";
	
	ЗапросВыручка.УстановитьПараметр("Пользователь", ТекПользователь);
	ЗапросВыручка.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
	ЗапросВыручка.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодОтчета.ДатаОкончания));
	
	СостояниеЗаявки = Справочники.ВидыСостоянийЗаявок.НайтиПоНаименованию("Выполнена");
	ЗапросВыручка.УстановитьПараметр("СостояниеВыполнена", СостояниеЗаявки);
	
	РезВыручка = ЗапросВыручка.Выполнить();
	Если Не РезВыручка.Пустой() Тогда
		ВыбВыручка = РезВыручка.Выбрать();
		ВыбВыручка.Следующий();
		ВыручкаОператора = ВыбВыручка.СуммаВыручки;
	КонецЕсли;
	Если ВыручкаОператора = Неопределено Тогда 
		ВыручкаОператора = 0; 
	КонецЕсли;
	
	// ==========================================
	// 2.1. ПОЛУЧЕНИЕ ПЛАНА (KPI) И РАСЧЕТ % ВЫПОЛНЕНИЯ
	// ==========================================
	ЗапросПлан = Новый Запрос;
	ЗапросПлан.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПлановыеПоказателиСотрудниковСрезПоследних.Значение, 0) КАК ПланВыручки
	|ИЗ
	|	РегистрСведений.омг_ПлановыеПоказателиСотрудников.СрезПоследних(
	|		&ДатаОкончания,
	|		Пользователь = &Пользователь
	|			И Показатель = &ПоказательВыручка
	|	) КАК ПлановыеПоказателиСотрудниковСрезПоследних";
	
	ЗапросПлан.УстановитьПараметр("Пользователь", ТекПользователь);
	ЗапросПлан.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодОтчета.ДатаОкончания)); 
	
	ПоказательВыручки = Справочники.ПоказателиKPI.НайтиПоНаименованию("Выручка оператора");
	ЗапросПлан.УстановитьПараметр("ПоказательВыручка", ПоказательВыручки);
	
	РезПлан = ЗапросПлан.Выполнить();
	Если Не РезПлан.Пустой() Тогда
		ВыбПлан = РезПлан.Выбрать();
		ВыбПлан.Следующий();
		ПланОператора = ВыбПлан.ПланВыручки;
	Иначе
		ПланОператора = 0;
	КонецЕсли;
	
	Если ПланОператора > 0 Тогда
		ПроцентВыполненияПлана = Окр((ВыручкаОператора / ПланОператора) * 100, 1);
	Иначе
		ПроцентВыполненияПлана = 0; 
	КонецЕсли;
	
	ОсталосьВыполнить = ПланОператора - ВыручкаОператора;
	Если ОсталосьВыполнить < 0 Тогда 
		ОсталосьВыполнить = 0; 
	КонецЕсли;
	// ==========================================
	// 2.2. ОТРИСОВКА ДИАГРАММЫ: СПИДОМЕТР (KPI ВЫРУЧКА)
	// ==========================================
	ДиаграммаВыручка.Обновление = Ложь;
	ДиаграммаВыручка.Очистить();
	ДиаграммаВыручка.АвтоТранспонирование = Ложь;
	
	ТочкаВыручка = ДиаграммаВыручка.УстановитьТочку("Выполнение плана");
	СерияФакт    = ДиаграммаВыручка.УстановитьСерию("Факт");
	
	ДиаграммаВыручка.УстановитьЗначение(ТочкаВыручка, СерияФакт, ВыручкаОператора);
	
	
	Если ПланОператора > 0 Тогда
		ДиаграммаВыручка.ОбластьЗаголовка.Текст = "План: " + ПланОператора + Символы.ПС + 
												  "Выполнено: " + ПроцентВыполненияПлана + "%";
	Иначе
		ДиаграммаВыручка.ОбластьЗаголовка.Текст = "Выручка: " + ВыручкаОператора + " (План не задан)";
	КонецЕсли;
    
	ДиаграммаВыручка.Обновление = Истина;
	// ==========================================
	// 3. WHATSAPP: ЗАВЕРШЕННЫЕ ЧАТЫ
	// ==========================================
	ЗапросЧаты = Новый Запрос;
	ЗапросЧаты.Текст = 
	"ВЫБРАТЬ
	|	// 1. Сколько всего чатов было у оператора
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР 
	|		КОГДА iga_ОчередьРаспределения.Оператор = &Пользователь 
	|		ТОГДА iga_ОчередьРаспределения.Чат 
	|		ИНАЧЕ NULL 
	|	КОНЕЦ) КАК МоиЧатыВсего,
	|
	|	// 2. Сколько чатов оператор завершил
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР 
	|		КОГДА iga_ОчередьРаспределения.Оператор = &Пользователь 
	|			И iga_ОчередьРаспределения.Статус = &СтатусЗавершен 
	|		ТОГДА iga_ОчередьРаспределения.Чат 
	|		ИНАЧЕ NULL 
	|	КОНЕЦ) КАК МоиЧатыЗавершенные,
	|
	|	// 3. Сколько всего чатов завершено по всему филиалу
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР 
	|		КОГДА iga_ОчередьРаспределения.Статус = &СтатусЗавершен 
	|		ТОГДА iga_ОчередьРаспределения.Чат 
	|		ИНАЧЕ NULL 
	|	КОНЕЦ) КАК ЧатыФилиалаЗавершенные
	|ИЗ
	|	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	|		// Связываем с настройками, чтобы отфильтровать операторов только нашего филиала
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|		ПО iga_ОчередьРаспределения.Оператор = НастройкиПользователей.Пользователь
	|ГДЕ
	|	iga_ОчередьРаспределения.ДатаПоследнейАктивности МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НастройкиПользователей.Настройка = &НастройкаОрганизация
	|	И НастройкиПользователей.Значение = &ТекФилиал";
	
	ЗапросЧаты.УстановитьПараметр("Пользователь", ТекПользователь);
	ЗапросЧаты.УстановитьПараметр("ТекФилиал", ТекФилиал);
	ЗапросЧаты.УстановитьПараметр("НастройкаОрганизация", ПланыВидовХарактеристик.НастройкиПользователей.омг_ОсновнаяОрганизация);
	ЗапросЧаты.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
	ЗапросЧаты.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодОтчета.ДатаОкончания));
	ЗапросЧаты.УстановитьПараметр("СтатусЗавершен", ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.Завершен"));
	
	РезЧаты = ЗапросЧаты.Выполнить(); 	
	Если Не РезЧаты.Пустой() Тогда
		ВыбЧаты = РезЧаты.Выбрать();
		ВыбЧаты.Следующий();
		
		МоиЧатыВсего           = ?(ВыбЧаты.МоиЧатыВсего = NULL, 0, ВыбЧаты.МоиЧатыВсего);
		МоиЧатыЗавершенные     = ?(ВыбЧаты.МоиЧатыЗавершенные = NULL, 0, ВыбЧаты.МоиЧатыЗавершенные);
		ЧатыФилиалаЗавершенные = ?(ВыбЧаты.ЧатыФилиалаЗавершенные = NULL, 0, ВыбЧаты.ЧатыФилиалаЗавершенные);
	Иначе
		МоиЧатыВсего           = 0;
		МоиЧатыЗавершенные     = 0;
		ЧатыФилиалаЗавершенные = 0;
	КонецЕсли;
	
	МоиЧатыВРаботе = МоиЧатыВсего - МоиЧатыЗавершенные;
	Если МоиЧатыВРаботе < 0 Тогда 
		МоиЧатыВРаботе = 0; 
	КонецЕсли;
	
	ЧатыКоллегЗавершенные = ЧатыФилиалаЗавершенные - МоиЧатыЗавершенные;
	Если ЧатыКоллегЗавершенные < 0 Тогда 
		ЧатыКоллегЗавершенные = 0; 
	КонецЕсли;
	// ==========================================
	// ОТРИСОВКА: ЛИЧНАЯ ЭФФЕКТИВНОСТЬ (% своих завершенных)
	// ==========================================
	ДиаграммаЧатыМои.Обновление = Ложь;
	ДиаграммаЧатыМои.Очистить();
	ДиаграммаЧатыМои.АвтоТранспонирование = Ложь;
	
	ТочкаМоиЧаты = ДиаграммаЧатыМои.УстановитьТочку(МоиЧатыВсего);
	
	СерияМоиЗаверш = ДиаграммаЧатыМои.УстановитьСерию("Мои завершенные");
	СерияМоиЗаверш.Цвет = WebЦвета.ЗеленыйЛес; 	
	ДиаграммаЧатыМои.УстановитьЗначение(ТочкаМоиЧаты, СерияМоиЗаверш, МоиЧатыЗавершенные);
	
	СерияМоиВРаботе = ДиаграммаЧатыМои.УстановитьСерию("Мои в работе (незавершенные)");
	СерияМоиВРаботе.Цвет = WebЦвета.СветлоСерый;
	ДиаграммаЧатыМои.УстановитьЗначение(ТочкаМоиЧаты, СерияМоиВРаботе, МоиЧатыВРаботе);
	
	ДиаграммаЧатыМои.Обновление = Истина;
	
	
	// ==========================================
	// ОТРИСОВКА: ВКЛАД В ФИЛИАЛ (Сравнение с коллегами)
	// ==========================================
	ДиаграммаЧатыФилиал.Обновление = Ложь;
	ДиаграммаЧатыФилиал.Очистить();
	ДиаграммаЧатыФилиал.АвтоТранспонирование = Ложь;
	
	ТочкаЧатыФилиал = ДиаграммаЧатыФилиал.УстановитьТочку(ЧатыФилиалаЗавершенные);
	
	СерияМойВклад = ДиаграммаЧатыФилиал.УстановитьСерию("Завершенные мной");
	СерияМойВклад.Цвет = WebЦвета.Желтый; 
	ДиаграммаЧатыФилиал.УстановитьЗначение(ТочкаЧатыФилиал, СерияМойВклад, МоиЧатыЗавершенные);
	
	СерияКоллегиЧаты = ДиаграммаЧатыФилиал.УстановитьСерию("Завершенные другими операторами");
	ДиаграммаЧатыФилиал.УстановитьЗначение(ТочкаЧатыФилиал, СерияКоллегиЧаты, ЧатыКоллегЗавершенные);
	
	ДиаграммаЧатыФилиал.Обновление = Истина;
	
	// ==========================================
	// 4. СРЕДНЯЯ ОЦЕНКА ОПЕРАТОРА (ЗА ВСЕ ВРЕМЯ)
	// ==========================================
	ЗапросОценка = Новый Запрос;
	ЗапросОценка.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СРЕДНЕЕ(iga_ИсторияОценокРаботыОператоров.Оценка), 0) КАК СреднийБалл
	|ИЗ
	|	РегистрСведений.iga_ИсторияОценокРаботыОператоров КАК iga_ИсторияОценокРаботыОператоров
	|ГДЕ
	|	iga_ИсторияОценокРаботыОператоров.Оператор = &Пользователь"; 
	
	ЗапросОценка.УстановитьПараметр("Пользователь", ТекПользователь);
	
	РезОценка = ЗапросОценка.Выполнить();
	Если Не РезОценка.Пустой() Тогда
		ВыбОценка = РезОценка.Выбрать();
		ВыбОценка.Следующий();
		
		СредняяОценка = Окр(ВыбОценка.СреднийБалл, 1);
	Иначе
		СредняяОценка = 0;
	КонецЕсли;
	// ==========================================
	// 4.1. ОТРИСОВКА ОЦЕНКИ И ПОЯСНЯЮЩЕГО ТЕКСТА
	// ==========================================
	
	ТекстПояснения = "";
	ЦветОценки = WebЦвета.Черный;
	
	Если СредняяОценка >= 4.8 Тогда
		ТекстПояснения = "Отличный сервис! Так держать!";
		ЦветОценки = WebЦвета.ЗеленыйЛес; 
		
	ИначеЕсли СредняяОценка >= 4.0 Тогда
		ТекстПояснения = "Хорошая работа";
		ЦветОценки = WebЦвета.Оливковый; 
		
	ИначеЕсли СредняяОценка >= 3.0 Тогда
		ТекстПояснения = "В пределах нормы, но есть куда расти";
		ЦветОценки = WebЦвета.Оранжевый; 
		
	ИначеЕсли СредняяОценка > 0 Тогда
		ТекстПояснения = "Критично! Требуется внимание";
		ЦветОценки = WebЦвета.Красный; 
		
	Иначе
		ТекстПояснения = "Оценок пока нет";
		ЦветОценки = WebЦвета.СероеОкно; 
	КонецЕсли;
	
	Если СредняяОценка > 0 Тогда
		Элементы.ДекорацияОценка.Заголовок = Строка(СредняяОценка) + Символы.ПС + ТекстПояснения;
	Иначе
		Элементы.ДекорацияОценка.Заголовок = "0.0 / 5.0" + Символы.ПС + ТекстПояснения;
	КонецЕсли;
	
	Элементы.ДекорацияОценка.ЦветТекста = ЦветОценки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФильтрыТест(Команда)
	Элементы.ГруппаТестовыйДанных.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСобытий(Команда)
	ОткрытьФорму("Документ.Событие.Форма.ФормаСписка85");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// ==========================================
	// УСТАНОВКА ПЕРИОДА ДЛЯ ДЕМО-ВЕРСИИ
	// ==========================================
	// Задаем жестко февраль 2026 года
	НачалоФевраля = '20260201';
	
	ПериодОтчета.ДатаНачала = НачалоФевраля;
	ПериодОтчета.ДатаОкончания = КонецМесяца(НачалоФевраля); 	
	РассчитатьПоказателиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СменаПароля(Команда)
	ОткрытьФорму("ОбщаяФорма.СменаПароля", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
